[
  {
    "icon": "Rocking",
    "company": "Rocking",
    "jobs": [
      {
        "jobTitle": "Web UI Developer",
        "description": "Designed, built, and delivered a web app to Evolucion Medica. The app was designed to change the data shown based on the URL, and thus this project also needed for the web app to be generic enough to handle all the different enviroments. Clients can use the web app to manage, schedule, and request appointments.",
        "technologies": [
          "React",
          "React Router",
          "TypeScript",
          "HTML",
          "CSS",
          "Tanstack Query"
        ],
        "startMonth": "November",
        "startYear": "2025",
        "endMonth": "December",
        "endYear": "2025"
      }
    ]
  },
  {
    "icon": "UTN",
    "company": "Universidad Tecnologica Nacional",
    "jobs": [
      {
        "jobTitle": "College Auxiliary Professor",
        "description": "Teaching programming concepts, complementing the explanations of the lead teacher and providing personalized support to students in solving problems and practical exercises.",
        "technologies": ["JavaScript", "NodeJS"],
        "startMonth": "August",
        "startYear": "2025",
        "endMonth": null,
        "endYear": null
      }
    ]
  },
  {
    "icon": "Globant",
    "company": "Globant",
    "jobs": [
      {
        "jobTitle": "Web UI Developer for Royal Caribbean",
        "description": "Contributed to the implementation of automated, dynamic email campaigns for key initiatives such as Courtesy Retention, Watch Lists, Cart Abandonment Offers, and targeted Casino promotions. Developed and maintained responsive, multilingual email templates using HTML, CSS, JavaScript, and AMPScript, ensuring the right message was delivered to the right user at the optimal time. Additionally, supported frontend development using React, TypeScript, and Redux, applying automated testing practices with Jest, Cypress, and Mock Service Worker to ensure quality and reliability.",
        "technologies": [
          "React",
          "Redux",
          "JavaScript",
          "TypeScript",
          "CSS",
          "Jira",
          "HTML",
          "Cypress",
          "Jest",
          "Mock Service Worker (MSW)"
        ],
        "startMonth": "July",
        "startYear": "2025",
        "endMonth": "October",
        "endYear": "2025"
      },
      {
        "jobTitle": "Web UI Developer for BBVA",
        "description": "Developed web interfaces for banking operations in a production environment. Implemented a critical banking transfer feature and led the migration of components to Lit Element, achieving an approximate 30% performance improvement. Ensured compliance with financial standards and UI/UX best practices, and actively participated in code reviews to maintain high levels of code quality and security.",
        "technologies": [
          "Lit",
          "Polymorph",
          "TypeScript",
          "CSS",
          "Jira",
          "HTML"
        ],
        "startMonth": "January",
        "startYear": "2025",
        "endMonth": "June",
        "endYear": "2025"
      },
      {
        "jobTitle": "Web UI Developer for Academy",
        "description": "Developed and maintained an internal educational platform used by over 10,000 employees globally. Implemented SSO authentication integrated with Globant corporate APIs, replacing the traditional login flow and significantly improving the onboarding experience. Also developed a complete user registration module with customized flows based on user type (employees, candidates, and partners), with a strong focus on frontend scalability, maintainability, and best practices.",
        "technologies": [
          "Next.js",
          "React",
          "TypeScript",
          "Tailwind CSS",
          "Jira",
          "Mock Service Worker (MSW)",
          "Axios"
        ],
        "startMonth": "October",
        "startYear": "2024",
        "endMonth": "January",
        "endYear": "2025"
      }
    ]
  },
  {
    "icon": "JPSystems",
    "company": "JPSystem",
    "jobs": [
      {
        "jobTitle": "Frontend Developer",
        "description": "UI development for JPSystem. Web application to control stock and manage customers for businesses, combining entry and search of products by barcode; developed with Next.js, JavaScript and Tailwind.",
        "technologies": [
          "Next.js",
          "React",
          "JavaScript",
          "Tailwind CSS",
          "Tanstack",
          "HTML",
          "Axios"
        ],
        "startMonth": "August",
        "startYear": "2023",
        "endMonth": "January",
        "endYear": "2024"
      }
    ]
  }
]
